<?php

return [
    'app.name' => 'ИИ для PHP-разработчиков (примеры)',

    'nav.home' => 'Главная',
    'nav.introduction' => 'Введение',
    'nav.getting_started' => 'С чего начать',
    'nav.part1_title' => 'Часть I. Математический язык ИИ',
    'nav.what_is_model' => 'Что такое модель',

    'home.title' => 'Главная',
    'home.heading' => 'С чего начать',
    'home.intro' => 'Это примеры к книге по ИИ на PHP.',
    'home.official_site' => 'Официальный сайт',
    'home.official_repo' => 'Официальный репозиторий',
    'home.all_examples' => 'Все примеры кода написаны на PHP 8.4',

    'home.disclaimer_title' => 'Отказ от ответственности',
    'home.disclaimer_p1' => 'Примеры кода, приведённые в книге «ИИ для PHP-разработчиков», предназначены только для учебных целей. Они демонстрируют концепции и техники искусственного интеллекта и машинного обучения на PHP. Эти примеры не предназначены для промышленной эксплуатации и не должны использоваться на боевых серверах или в системах, работающих с конфиденциальными данными.',
    'home.disclaimer_p2' => 'Демонстрационный код не проходил полноценное тестирование на безопасность и может содержать неточности, уязвимости, неэффективные решения и другие проблемы, которые могут представлять риск при использовании в продакшене. Он может быть не на 100% точен и не всегда соответствовать лучшим практикам. Перед использованием таких решений в реальных приложениях настоятельно рекомендуется их тщательно проверить, протестировать и обезопасить.',
    'home.disclaimer_p3' => 'Автор и издатель не несут ответственности за какие-либо инциденты безопасности, потерю данных или другие убытки, которые могут возникнуть при использовании этих примеров на боевых серверах.',

    'common.example_of_use' => 'Пример использования',
    'common.copy' => 'копировать',
    'common.copied' => 'Cкопировано!',

    'what_is_model.heading' => 'Что такое модель в математическом смысле',
    'what_is_model.button_title' => 'Функция как основа модели',
    'what_is_model.description1' => 'Допустим, мы хотим предсказывать цену квартиры по ее площади. В простейшем случае модель можно взять линейную: $ŷ = w x + b$ <br><br>Это уже полноценная модель. Она говорит: «Цена ($ŷ$) приблизительно равна площади ($x$), умноженной на некоторый коэффициент ($w$), плюс некоторое смещение ($b$)». <br><br>Если переписать это на PHP, получится почти тривиальный код:',
    'what_is_model.description2' => 'Предсказание цены квартиры по ее площади. Используем линейную функцию: $ŷ = w x + b$',
    'what_is_model.explanation_simple' => 'Пояснение: $2 * 3 + 0 = 6$ <br>По формуле: $ŷ = 2 x + b$',
];
